_____________________________________________________________________________________________________________________________________________________

# Итоговая проверочная работа

_____________________________________________________________________________________________________________________________________________________

Данная работа необходима для проверки ваших знаний и навыков по итогу прохождения первого блока обучения на программе разработчик. Мы должны убедиться что базовое знакомство с it прошло успешно.

Задача алгоритмически не самая сложная, однако для полценного выполнения проверочной работы необходимо:

* создать репозиторий на GitHub
* нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод)
* снабдить репозиторий оформленным текстовым описанием решения (файл README.md)
* написать программу, решающую поставленную задачу
* использовать контроль версий в работе над этим небольшим проектом (не должно быть так что все залито одним коммитом, как минимум этапы 2, 3 и 4 должны быть расположены в разных коммитах)

_____________________________________________________________________________________________________________________________________________________

## Задача

_____________________________________________________________________________________________________________________________________________________

Написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел. Первоначальный массив можно ввести с клавиатуры, либо сгенерировать случайным образом. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:

[1, 2, 3, 4] -> [2, 4]
[1, 3, 4, 5, 7, 1, 3] -> [4]
[2, -4, 6] -> [2, -4, 6]
[1, 3, 5] -> []

_____________________________________________________________________________________________________________________________________________________

## Блок-схема

_____________________________________________________________________________________________________________________________________________________

_____________________________________________________________________________________________________________________________________________________

## Алгоритм решения

_____________________________________________________________________________________________________________________________________________________

* Начинаем формирование кода с "Console.Clear();"
* Добавляем описание задания
* Задаем массивы строк и назначаем переменные
* Поскольку отсутствует конкретное требование к размеру массива, мы задаем данные вручную. Для этого используем переменную "count"
* Выделяем память для массива из "count" строк. Размер "массива №2", содержащего конечный результат, принимаем за массива №1 <(размер массива 2 может быть <= размеру "массива №1", но не больше него)>
* Запускаем цикл для ввода строк массива с клавиатуры
* Проверяем соответсвие элементов массива требованию задания и формируем "массив №2". Для этого запускаем цикл для поэментного сравнения длины строк "массива №1". Если текущая длина строки массива <=3, то записывае данную строку в "массив №2". При заполнении "массива №2" используется переменная "j", в которой сохраняется текущий индекс элемента.
При достижении счетчиком максимального значения <(размер массива), цикл завершается.
* Выводим элементы "массива №2" на экран.

_____________________________________________________________________________________________________________________________________________________

## Написание кода

_____________________________________________________________________________________________________________________________________________________

Console.Clear();
Console.WriteLine($"Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше либо равна 3.");
string[] array1;
string[] array2;
int count;
int j = 0;
Console.Write("Количество элеметов массива: ");
count = Int32.Parse(Console.ReadLine());
array1 = new string[count];
array2 = new string[count];
Console.WriteLine("Введите массив из строк:");
for (int i = 0; i < array1.Length; i++)
{
    Console.Write("Элемент массива [{0}] = ", i);
    array1[i] = Console.ReadLine();
}
for (int i = 0; i < array1.Length; i++)
    if (array1[i].Length <= 3)
    {
        array2[j] = array1[i];
        j++;
    }
Console.Write("Массив из строк, длина которых меньше либо равна 3: [  ");
for (int i = 0; i < array2.Length; i++)
    Console.Write("{0} ", array2[i]);
Console.Write("] ");
Console.ReadKey();
