//                                          СЕМИНАР №9. Как не нужно писать код. Часть 3
// _____________________________________________________________________________________________________________________________________________________
// Задача 64: Задайте значения M и N. Напишите программу, которая выведет все натуральные числа в промежутке от M до N. 
// (Решать методом рекурсии, на семинаре вторая задача похожа)
// M = 1; N = 5. -> ""1, 2, 3, 4, 5""
// M = 4; N = 8. -> ""4, 6, 7, 8""
// _____________________________________________________________________________________________________________________________________________________
Console.Clear();
Console.WriteLine("Напишите программу, которая выведет все натуральные числа в промежутке от M до N.");
int Sum(int m, int n)
{
    if (n < m)
        return 1;
    return m + Sum(m + 1, n);
}
Console.Write("Введите натуральное число в промежутке от M: ");
int m = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите натуральное число в промежутке до N: ");
int n = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(Sum(m, n) - 1);
// _____________________________________________________________________________________________________________________________________________________
// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N. 
// (Решать методом рекурсии, на семинаре третья задача похожа)
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30
// _____________________________________________________________________________________________________________________________________________________
Console.Clear();
Console.WriteLine("Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.");
int m = InputNumbers("Введите m: ");
int n = InputNumbers("Введите n: ");
int temp = m;

if (m > n)
{
    m = n;
    n = temp;
}

PrintSumm(m, n, temp = 0);

void PrintSumm(int m, int n, int summ)
{
    summ = summ + n;
    if (n <= m)
    {
        Console.Write($"Сумма элементов = {summ} ");
        return;
    }
    PrintSumm(m, n - 1, summ);
}

int InputNumbers(string input)
{
    Console.Write(input);
    int output = Convert.ToInt32(Console.ReadLine());
    return output;
}
// _____________________________________________________________________________________________________________________________________________________
// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 29
// _____________________________________________________________________________________________________________________________________________________
Console.Clear();
Console.WriteLine("Напишите программу вычисления функции Аккермана с помощью рекурсии.");
int m = InputNumbers("Введите m: ");
int n = InputNumbers("Введите n: ");

int functionAkkerman = Ack(m, n);

Console.Write($"Функция Аккермана = {functionAkkerman} ");

int Ack(int m, int n)
{
    if (m == 0) return n + 1;
    else if (n == 0) return Ack(m - 1, 1);
    else return Ack(m - 1, Ack(m, n - 1));
}

int InputNumbers(string input)
{
    Console.Write(input);
    int output = Convert.ToInt32(Console.ReadLine());
    return output;
}
// _____________________________________________________________________________________________________________________________________________________


